# Задача 2: Найдите сумму цифр трехзначного числа.
#
# *Пример:*
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

n = int(input('Введите трехзначное число -  '))
if(n-999 > 0 or n < 100):
    print('Не трехзначное число')
else:
    print((n // 100)+((n // 10)%10)+(n%10))
    # print(n // 100)
    # print((n // 10)%10)
    # print(n%10)

