# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
# Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов
# (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова,
# если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами.
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если
# с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
#
# *Пример:*
#
# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да
#     **Вывод:** Парам пам-пам

lyrics = input('Винни твой стих - ').split()

#count_list = list()
# for phrase in lyrics:
#     count = 0
#     phrase = list(phrase)
#     for letter in phrase:
#         if letter == 'а': count += 1
#     count_list.append(count)

count_list=set(sum(map(lambda x:x=='а',i))for i in lyrics)
print(count_list)

print('Парам пам-пам' if len(count_list)<2 else 'Пам парам')


